/* BizSimAI - Simplified Chinese Localization */

/* Common */
"app.name" = "BizSimAI";
"common.login" = "登录";
"common.logout" = "退出登录";
"common.save" = "保存";
"common.cancel" = "取消";
"common.error" = "错误";
"common.loading" = "加载中...";
"common.success" = "成功";
"common.retry" = "重试";
"common.submit" = "提交";
"common.back" = "返回";
"common.done" = "完成";
"common.delete" = "删除";
"common.edit" = "编辑";
"common.close" = "关闭";

/* Authentication */
"auth.professor_login" = "教授登录";
"auth.student_access" = "学生访问";
"auth.username" = "用户名";
"auth.password" = "密码";
"auth.student_id" = "学号";
"auth.full_name" = "姓名";
"auth.team_name" = "团队名称";
"auth.register" = "注册并加入";
"auth.sign_in_apple" = "通过Apple登录";
"auth.sign_in_google" = "通过Google登录";
"auth.session_expired" = "会话已过期，请重新登录。";

/* Session */
"session.create" = "创建会话";
"session.join" = "加入会话";
"session.code" = "会话代码";
"session.round" = "第%d轮，共%d轮";
"session.status_waiting" = "等待玩家";
"session.status_active" = "进行中";
"session.status_completed" = "已完成";
"session.end" = "结束会话";
"session.delete" = "删除会话";

/* Decisions */
"decision.submit" = "提交决策";
"decision.submitted" = "决策已提交";
"decision.over_budget" = "超出预算";
"decision.invalid" = "无效决策";

/* Results */
"results.leaderboard" = "排行榜";
"results.profit" = "利润";
"results.revenue" = "收入";
"results.market_share" = "市场份额";
"results.stock_price" = "股价";
"results.cumulative" = "累计";

/* Sync */
"sync.online" = "在线";
"sync.offline" = "离线";
"sync.syncing" = "同步中...";
"sync.error" = "同步失败";
"sync.saved_locally" = "已本地保存";

/* Professor */
"prof.dashboard" = "仪表板";
"prof.sessions" = "会话管理";
"prof.analytics" = "分析";
"prof.announcements" = "公告";
"prof.grade_mapping" = "成绩映射";

/* Student */
"student.team_dashboard" = "团队仪表板";
"student.ai_coach" = "AI教练";
"student.performance" = "表现";

/* Navigation */
"nav.home" = "首页";
"nav.settings" = "设置";
"nav.profile" = "个人资料";
"nav.help" = "帮助";

/* Errors */
"error.network" = "网络错误，请检查您的连接。";
"error.server" = "服务器错误，请稍后重试。";
"error.unauthorized" = "未授权，请重新登录。";
"error.not_found" = "未找到资源。";
